web/app/controllers/api_controller.rb

	def urls
		@urls = Url.where(:user_id => @user.id).limit(params[:limit]).offset(params[:offset]).order(created_at: :desc)
		@urls.each do |url|
---
SELECT `urls`.* FROM `urls` WHERE `urls`.`user_id` = 2 ORDER BY `urls`.`created_at` DESC LIMIT 1 OFFSET 0

	def new_url
		@url = Url.new(:long_url => params[:long_url], :user_id => @user.id)
	    @url.generate_short_url
	    while(!(Url.find_by short_url: @url.short_url).nil?)
	    	@url.generate_short_url
	    end
	    @url.click = 0
	    if @url.save
---
SELECT `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'mj4u3z' LIMIT 1
INSERT INTO `urls` (`long_url`, `short_url`, `click`, `user_id`, `created_at`, `updated_at`) VALUES ('https://www.yiiframework.com/wiki', '6gmha3', 0, 5, '2021-09-22 08:56:06.196833', '2021-09-22 08:56:06.196833')

	def authen
		authenticate_or_request_with_http_basic  do |name, password|
	      	@user = User.find_by name: name
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'phumv1' LIMIT 1