web/app/controllers/session_controller.rb

  def create
    user = User.find_by name: params[:session][:name].downcase
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'abczyx' LIMIT 1