web/app/controllers/urls_controller.rb

SELECT `urls`.* FROM `urls` WHERE `urls`.`user_id` = 3 ORDER BY `urls`.`created_at` DESC
---
  def index
    @urls = Url.where(:user_id => @user.id).all.order(created_at: :desc)

SELECT `urls`.* FROM `urls` WHERE `urls`.`short_url` = '0aizgk' LIMIT 1
INSERT INTO `urls` (`long_url`, `short_url`, `click`, `user_id`, `created_at`, `updated_at`) VALUES ('https://www.yiiframework.com/extension/yii-streamlog', 'w31vjl', 0, 1, '2021-09-22 09:45:54.417260', '2021-09-22 09:45:54.417260')
---
  def create
    @url = Url.new(url_params)
    @url.generate_short_url
    while(!(Url.find_by short_url: @url.short_url).nil?)
      @url.generate_short_url
    end
    @url.click = 0
    if @url.save

UPDATE `urls` SET `urls`.`long_url` = 'http://google.com', `urls`.`updated_at` = '2021-09-21 14:10:38.620400' WHERE `urls`.`id` = 11
UPDATE `urls` SET `urls`.`long_url` = 'http://google.com', `urls`.`updated_at` = '2021-09-21 07:33:16.216626' WHERE `urls`.`id` = 6
---
  def update
    find_url
    @url.update(url_params)
    if @url.save

DELETE FROM `urls` WHERE `urls`.`id` = 7
---
  def destroy
    find_url
    check = @url.destroy

SELECT `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'cohipq' LIMIT 1
UPDATE `urls` SET `urls`.`click` = 1, `urls`.`updated_at` = '2021-09-21 10:56:58.119937' WHERE `urls`.`id` = 8
---
  def shortened
    @url = Url.find_by_short_url params[:short_url]
    # raise @url.to_json
    if (@url)
      @url.click += 1
      @url.save

SELECT `urls`.* FROM `urls` WHERE `urls`.`user_id` = 2 AND `urls`.`id` = 7 LIMIT 1
---
  def find_url
    @url = @user.urls.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def find_user
    @user = User.find(params[:user_id])