web/app/controllers/users_controller.rb

	def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('phumv1', 'phumv1@gmail.com', '$2a$12$02dxFEnUsbF9FKCFk/Kxq.BBO/i9LC2sDAK9qadqA69C0.jbUh7/y', '2021-09-21 12:43:36.369751', '2021-09-21 12:43:36.369751')

  def show
    @user = User.find_by id: params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1