web/app/models/url.rb

SELECT `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'tv7lor' ORDER BY `urls`.`id` DESC LIMIT 1
SELECT `urls`.* FROM `urls` WHERE `urls`.`short_url` = 'soiujh' ORDER BY `urls`.`id` DESC LIMIT 1
---
  def generate_short_url
    url = ([*("a".."z"),*("0".."9")]).sample(UNIQUE_ID_LENGTH).join
    long_url = Url.where(short_url: url).last
    if long_url.present?