web/app/helpers/session_helper.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def current_user
    # raise session.to_json
    @current_user ||= User.find_by id: session[:user_id]